; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v2)
             (pred_3 ?v1 ?v5)
             (pred_5 ?v9 ?v5)
             (pred_8 ?v8 ?v9 )
	     (pred_9 ?v9)
             (pred_11 ?v3)
             (pred_2 ?v1)
             (pred_4 ?v5)
             (pred_7 ?v9)
             (pred_12 ?v1)
             (pred_1 ?v9)
             (pred_6 ))



(:action op_3
:parameters (?v4 ?v10 ?v7 ?v13)
:precondition (and (pred_11 ?v4) (pred_11 ?v10) (pred_2 ?v7) (pred_4 ?v13)
          (pred_10 ?v4 ?v10) (pred_3 ?v7 ?v13)
                   (pred_5 ?v10 ?v13) (pred_9 ?v4) 
                   (pred_7 ?v10) (pred_12 ?v7))
:effect (and  (pred_1 ?v10) (not (pred_7 ?v10))))


(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_11 ?v4) (pred_11 ?v11)
               (pred_9 ?v4) (pred_10 ?v4 ?v11) (pred_1 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v4))))

(:action op_1
:parameters (?v4 ?v7)
:precondition (and (pred_11 ?v4) (pred_2 ?v7) 
                  (pred_9 ?v4) (pred_8 ?v7 ?v4) (pred_6 ))
:effect (and (pred_12 ?v7)
   (not (pred_8 ?v7 ?v4)) (not (pred_6 ))))


(:action op_5
:parameters (?v4 ?v6 ?v12)
:precondition (and (pred_11 ?v4) (pred_2 ?v6) (pred_2 ?v12)
                  (pred_9 ?v4) (pred_12 ?v12) (pred_8 ?v6 ?v4))
:effect (and (pred_12 ?v6) (pred_8 ?v12 ?v4)
        (not (pred_12 ?v12)) (not (pred_8 ?v6 ?v4))))

(:action op_2
:parameters (?v4 ?v7)
:precondition (and (pred_11 ?v4) (pred_2 ?v7) 
                  (pred_9 ?v4) (pred_12 ?v7))
:effect (and (pred_6 ) (pred_8 ?v7 ?v4) (not (pred_12 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_18 obj_26 obj_17 obj_10 obj_02 obj_23 obj_11 obj_25 obj_01 obj_29 obj_27 obj_24 obj_09 obj_13 obj_03 obj_20 obj_31 obj_28 obj_14 obj_21 obj_06 obj_07 obj_05 obj_22
    obj_15 obj_12 obj_30
    obj_19 obj_04 obj_08
    )

    (:init
       (pred_6)

       (pred_11 obj_16)
       (pred_11 obj_18)
       (pred_11 obj_26)
       (pred_11 obj_17)
       (pred_11 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_23)
       (pred_11 obj_11)
       (pred_11 obj_25)
       (pred_11 obj_01)
       (pred_11 obj_29)
       (pred_11 obj_27)
       (pred_11 obj_24)
       (pred_11 obj_09)
       (pred_11 obj_13)
       (pred_11 obj_03)
       (pred_11 obj_20)
       (pred_11 obj_31)
       (pred_11 obj_28)
       (pred_11 obj_14)
       (pred_11 obj_21)
       (pred_11 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_05)
       (pred_11 obj_22)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_30)
       (pred_2 obj_19)
       (pred_2 obj_04)
       (pred_2 obj_08)

       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_18 obj_23)
       (pred_10 obj_18 obj_26)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_26 obj_11)
       (pred_10 obj_26 obj_17)
       (pred_10 obj_26 obj_18)
       (pred_10 obj_17 obj_25)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_17 obj_26)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_02 obj_29)
       (pred_10 obj_02 obj_23)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_23 obj_27)
       (pred_10 obj_23 obj_11)
       (pred_10 obj_23 obj_18)
       (pred_10 obj_23 obj_02)
       (pred_10 obj_11 obj_24)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_11 obj_26)
       (pred_10 obj_11 obj_23)
       (pred_10 obj_25 obj_09)
       (pred_10 obj_25 obj_01)
       (pred_10 obj_25 obj_17)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_01 obj_13)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_25)
       (pred_10 obj_29 obj_03)
       (pred_10 obj_29 obj_27)
       (pred_10 obj_29 obj_02)
       (pred_10 obj_27 obj_20)
       (pred_10 obj_27 obj_24)
       (pred_10 obj_27 obj_23)
       (pred_10 obj_27 obj_29)
       (pred_10 obj_24 obj_31)
       (pred_10 obj_24 obj_09)
       (pred_10 obj_24 obj_11)
       (pred_10 obj_24 obj_27)
       (pred_10 obj_09 obj_28)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_25)
       (pred_10 obj_09 obj_24)
       (pred_10 obj_13 obj_14)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_03 obj_21)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_03 obj_29)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_31)
       (pred_10 obj_20 obj_27)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_31 obj_07)
       (pred_10 obj_31 obj_28)
       (pred_10 obj_31 obj_24)
       (pred_10 obj_31 obj_20)
       (pred_10 obj_28 obj_05)
       (pred_10 obj_28 obj_14)
       (pred_10 obj_28 obj_09)
       (pred_10 obj_28 obj_31)
       (pred_10 obj_14 obj_22)
       (pred_10 obj_14 obj_13)
       (pred_10 obj_14 obj_28)
       (pred_10 obj_21 obj_06)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_06 obj_21)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_07 obj_31)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_05 obj_22)
       (pred_10 obj_05 obj_28)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_22 obj_14)
       (pred_10 obj_22 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_18)
       (pred_7 obj_22)
       (pred_5  obj_21 obj_15)
       (pred_5  obj_18 obj_12)
       (pred_5  obj_22 obj_30)
       (pred_1 obj_16)
       (pred_1 obj_26)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_02)
       (pred_1 obj_23)
       (pred_1 obj_11)
       (pred_1 obj_25)
       (pred_1 obj_01)
       (pred_1 obj_29)
       (pred_1 obj_27)
       (pred_1 obj_24)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_20)
       (pred_1 obj_31)
       (pred_1 obj_28)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_05)

       (pred_3  obj_19 obj_15)
       (pred_3  obj_04 obj_12)
       (pred_3  obj_08 obj_30)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_08 obj_05)
       (pred_9 obj_01)
    )

    (:goal (and
       (pred_8 obj_04 obj_24)
       (pred_8 obj_08 obj_02)
    ))
(:constraints
  (always (not (pred_9 obj_28)))
)
)

; plan
1. (op_4 obj_01 obj_25)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_25)
   goals met: 0 of 2
2. (op_4 obj_25 obj_09)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_09)
   goals met: 0 of 2
3. (op_4 obj_09 obj_24)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_24)
   goals met: 0 of 2
4. (op_4 obj_24 obj_31)
   deleted: (pred_9 obj_24)
   added: (pred_9 obj_31)
   goals met: 0 of 2
5. (op_4 obj_31 obj_20)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_20)
   goals met: 0 of 2
6. (op_1 obj_20 obj_04)
   deleted: (pred_8 obj_04 obj_20) (pred_6)
   added: (pred_12 obj_04)
   goals met: 0 of 2
7. (op_4 obj_20 obj_31)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_31)
   goals met: 0 of 2
8. (op_4 obj_31 obj_24)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_24)
   goals met: 0 of 2
9. (op_2 obj_24 obj_04)
   deleted: (pred_12 obj_04)
   added: (pred_6) (pred_8 obj_04 obj_24)
   goals met: 1 of 2
10. (op_4 obj_24 obj_31)
   deleted: (pred_9 obj_24)
   added: (pred_9 obj_31)
   goals met: 1 of 2
11. (op_4 obj_31 obj_07)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_07)
   goals met: 1 of 2
12. (op_4 obj_07 obj_05)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_05)
   goals met: 1 of 2
13. (op_1 obj_05 obj_08)
   deleted: (pred_8 obj_08 obj_05) (pred_6)
   added: (pred_12 obj_08)
   goals met: 1 of 2
14. (op_4 obj_05 obj_07)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_07)
   goals met: 1 of 2
15. (op_4 obj_07 obj_31)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_31)
   goals met: 1 of 2
16. (op_4 obj_31 obj_24)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_24)
   goals met: 1 of 2
17. (op_4 obj_24 obj_11)
   deleted: (pred_9 obj_24)
   added: (pred_9 obj_11)
   goals met: 1 of 2
18. (op_4 obj_11 obj_23)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_23)
   goals met: 1 of 2
19. (op_4 obj_23 obj_02)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_02)
   goals met: 1 of 2
20. (op_2 obj_02 obj_08)
   deleted: (pred_12 obj_08)
   added: (pred_6) (pred_8 obj_08 obj_02)
   goals met: 2 of 2
